cmsis-svd/cmsis-svd/data/ArteryTek/AT32F403xx_v2.svd
        <register>
          <name>BK4IS</name>
          <displayName>BK4IS</displayName>
          <description>FIFO status and interrupt register 4</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>FIFOE</name>
              <description>FIFO empty</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FEIEN</name>
              <description>Falling edge interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLIEN</name>
              <description>High-level interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REIEN</name>
              <description>Rising edge interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FES</name>
              <description>Falling edge status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLS</name>
              <description>High-level status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RES</name>
              <description>Rising edge capture status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BK4TMGMEM</name>
          <displayName>BK4TMGMEM</displayName>
          <description>Regular memory space timing register 4</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>RGDHIZT</name>
              <description>Regular memory databus High resistance time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RGHT</name>
              <description>Regular memory hold time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RGWT</name>
              <description>Regular memory wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RGST</name>
              <description>Regular memory setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BK4TMGATT</name>
          <displayName>BK4TMGATT</displayName>
          <description>special memory space timing register 4</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>SPDHIZT</name>
              <description>special memory databus High resistance time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SPHT</name>
              <description>special memory hold time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SPWT</name>
              <description>special memory wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SPST</name>
              <description>special memory setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>BK4TMGIO</name>
          <displayName>BK4TMGIO</displayName>
          <description>special IO space timing register 4</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>IODHIZT</name>
              <description>IO space databus High resistance time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IOHT</name>
              <description>IO space hold time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IOWT</name>
              <description>IO space wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IOST</name>
              <description>IO space setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BK1TMGWR1</name>
          <displayName>BK1TMGWR1</displayName>
          <description>SRAM/NOR-Flash write timing registers
          1</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>BK1TMGWR2</name>
          <displayName>BK1TMGWR2</displayName>
          <description>SRAM/NOR-Flash write timing registers
          2</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>BK1TMGWR3</name>
          <displayName>BK1TMGWR3</displayName>
          <description>SRAM/NOR-Flash write timing registers
          3</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BK1TMGWR4</name>
          <displayName>BK1TMGWR4</displayName>
          <description>SRAM/NOR-Flash write timing registers
          4</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT1</name>
          <displayName>EXT1</displayName>
          <description>externl timeing register 1</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>EXT2</name>
          <displayName>EXT2</displayName>
          <description>externl timeing register 2</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>EXT3</name>
          <displayName>EXT3</displayName>
          <description>externl timeing register 3</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT4</name>
          <displayName>EXT4</displayName>
          <description>externl timeing register 4</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>BUSLATW2W</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>BUSLATR2R</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
